PoC/loadPoC.yaml
config:
  target: "https://dev.tria.so"
  phases:
    - duration: 1
#      arrivalRate: 1
      arrivalCount: 50
  processor: "./processor.js"
  variables:
    fromClientId: "7fc81e4118d1f8f59d48d513a63d561b:f7c89203ddf5487b1e55a00f68188912d66069cb078ab0611f5148c3395d1014fcebec4f1438bc328b2ad1d8b8b332684a668bca6f2786c55b2f4927299b1732833c3b1acaa44ced896abc4d22e4da18e080484519f960a1349ebda84278ae199b7df9117c1e:3dab23f16dad0832f359421744e7f0b0"
    origin: "https://tria-demo-staging.vercel.app"
    otp: "7R9K3P5A1Q"
scenarios:
  - flow:
      - function: "getRandomUsername"
#      - log: "Generated username: {{ username }}"
      - post:
          url: "/api/v2/auth/initiate-otp"
          json:
            email: "{{ username }}@yopmail.com"
            origin: "{{ origin }}"
            fromClientId: "{{ fromClientId }}"
          headers:
            Content-Type: "application/json"
#          expect:
#            - statusCode: 200
#          capture:
#            - json: "$.data"
#              as: "responseBody"
          afterResponse: "captureResponse"
      - function: "uploadToS3"
      #      - log: "Initiate OTP executed"
      - think: 10
      - post:
          url: "/api/v2/auth/verify-otp"
          json:
            otp: "{{ otp }}"
            email: "{{ username }}@yopmail.com"
            fromClientId: "{{ fromClientId }}"
          headers:
            Content-Type: "application/json"
          capture:
            - json: "$.accessToken"
              as: "accessToken"
          expect:
            - statusCode: 200
          afterResponse: "captureResponse"
      - function: "uploadToS3"
#      - log: "Access Token acquired from Verify OTP: {{ accessToken }}"
      - think: 10
      - post:
          url: "/api/v2/did/check"
          json:
            did: "{{ username }}@tria"
          headers:
            Content-Type: "application/json"
          capture:
            - json: "$.response.availabilityStatus"
              as: "availabilityStatus"
          expect:
            - statusCode: 200
          afterResponse: "captureResponse"
      - function: "uploadToS3"
#      - log: "Check DID response: {{ availabilityStatus }}"
      - think: 10
      - get:
          url: "/api/v2/get-name-recommendation"
          qs:
            name: "{{ username }}"
          capture:
            - json: "$.data"
              as: "recommendations"
          expect:
            - statusCode: 200
          afterResponse: "captureResponse"
      - function: "uploadToS3"
#      - log: "Name recommendations: {{ recommendations }}"
      - think: 10
      - post:
          url: "/api/v1/did/get-data"
          json:
            did: "{{ username }}@tria"
          headers:
            Content-Type: "application/json"
          capture:
            - json: "$.response"
              as: "createDIDData"
          expect:
            - statusCode: 200
          afterResponse: "captureResponse"
      - function: "uploadToS3"
#      - log: "DID Data: {{ createDIDData }}"
#      - log: "DID Data acquired"
      - function: "addFromClientID"
#      - log: "Appended DID Data: {{ createDIDData }}"
#      - log: "DID Data appended"
      - think: 10
      - post:
          url: "/api/v1/did/create"
          headers:
            Content-Type: "application/json"
            Authorization: "Bearer {{ accessToken }}"
          json: "{{ createDIDData }}"
          expect:
            - statusCode: 200
          afterResponse: "captureResponse"
      - function: "uploadToS3"
#      - log: "Account created"